Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAB288.PIC
    <edc:Pin>
      <!--Pin 141-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 142-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 143-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 144-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 145-->
      <edc:VirtualPin edc:name="DDRVREF"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 146-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 147-->
      <edc:VirtualPin edc:name="DDRDQ1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 148-->
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="SQID2"/>
      <edc:VirtualPin edc:name="SDDATA2"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 149-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 150-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 151-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 152-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 153-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 154-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 155-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 156-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 157-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 158-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 159-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 160-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="SCK6"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 161-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="AN29"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 162-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="RPD14" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 163-->
      <edc:VirtualPin edc:name="DDRCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 164-->
      <edc:VirtualPin edc:name="DDRCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 165-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="RPE5" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="EBIA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 166-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SQICS0"/>
      <edc:VirtualPin edc:name="SDCMD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 167-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 168-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 169-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 170-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 171-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 172-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 173-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 174-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 175-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 176-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 177-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 178-->
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="AN32"/>
      <edc:VirtualPin edc:name="EBIRDY3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 179-->
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="EBIA22"/>
      <edc:VirtualPin edc:name="GD20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 180-->
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="EBICS0"/>
      <edc:VirtualPin edc:name="VSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 181-->
      <edc:VirtualPin edc:name="DDRWE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 182-->
      <edc:VirtualPin edc:name="DDRCKE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 183-->
      <edc:VirtualPin edc:name="DDRA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 184-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SQICS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 185-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 186-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 187-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 188-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 189-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 190-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 191-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 192-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 193-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 194-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 195-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 196-->
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="EBICS3"/>
      <edc:VirtualPin edc:name="GEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 197-->
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="EBICS2"/>
      <edc:VirtualPin edc:name="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 198-->
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="EBICS1"/>
      <edc:VirtualPin edc:name="HSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 199-->
      <edc:VirtualPin edc:name="DDRRAS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 200-->
      <edc:VirtualPin edc:name="DDRBA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 201-->
      <edc:VirtualPin edc:name="DDRBA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 202-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 203-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 204-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 205-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 206-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 207-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 208-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 209-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 210-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 211-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 212-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 213-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 214-->
      <edc:VirtualPin edc:name="RJ13"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="EBID13"/>
      <edc:VirtualPin edc:name="GD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 215-->
      <edc:VirtualPin edc:name="RJ12"/>
      <edc:VirtualPin edc:name="EBIBS0"/>
      <edc:VirtualPin edc:name="GD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 216-->
      <edc:VirtualPin edc:name="RJ10"/>
      <edc:VirtualPin edc:name="EBIBS1"/>
      <edc:VirtualPin edc:name="GD18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 217-->
      <edc:VirtualPin edc:name="DDRODT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 218-->
      <edc:VirtualPin edc:name="DDRCS0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 219-->
      <edc:VirtualPin edc:name="DDRA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 220-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="EBIA13"/>
      <edc:VirtualPin edc:name="GD22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 221-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 222-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 223-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 224-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 225-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 226-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 227-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 228-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 229-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 230-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 231-->
      <edc:VirtualPin edc:name="RH7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="AN36"/>
      <edc:VirtualPin edc:name="EBIA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 232-->
      <edc:VirtualPin edc:name="RH2"/>
      <edc:VirtualPin edc:name="EBIRP"/>
      <edc:VirtualPin edc:name="SDWP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 233-->
      <edc:VirtualPin edc:name="RJ15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="EBIA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 234-->
      <edc:VirtualPin edc:name="RJ14"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="EBID11"/>
      <edc:VirtualPin edc:name="GD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 235-->
      <edc:VirtualPin edc:name="DDRA10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 236-->
      <edc:VirtualPin edc:name="DDRCAS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 237-->
      <edc:VirtualPin edc:name="DDRA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 238-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="SCL3"/>
      <edc:VirtualPin edc:name="RPF8" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 239-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 240-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 241-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 242-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 243-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 244-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 245-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 246-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 247-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 248-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 249-->
      <edc:VirtualPin edc:name="RK4"/>
      <edc:VirtualPin edc:name="EBIA18"/>
      <edc:VirtualPin edc:name="GD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 250-->
      <edc:VirtualPin edc:name="RK0"/>
      <edc:VirtualPin edc:name="EBIA16"/>
      <edc:VirtualPin edc:name="GD23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 251-->
      <edc:VirtualPin edc:name="RH11"/>
      <edc:VirtualPin edc:name="AN37"/>
      <edc:VirtualPin edc:name="EBIRDY2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 252-->
      <edc:VirtualPin edc:name="RH3"/>
      <edc:VirtualPin edc:name="AN35"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 253-->
      <edc:VirtualPin edc:name="DDRA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 254-->
      <edc:VirtualPin edc:name="DDRA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 255-->
      <edc:VirtualPin edc:name="DDRA9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 256-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 257-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 258-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBIA14"/>
      <edc:VirtualPin edc:name="GD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 259-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 260-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 261-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 262-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 263-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 264-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 265-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 266-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 267-->
      <edc:VirtualPin edc:name="RK5"/>
      <edc:VirtualPin edc:name="EBIA19"/>
      <edc:VirtualPin edc:name="GD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 268-->
      <edc:VirtualPin edc:name="RK3"/>
      <edc:VirtualPin edc:name="EBIA17"/>
      <edc:VirtualPin edc:name="GD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 269-->
      <edc:VirtualPin edc:name="RK2"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="EBIA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 270-->
      <edc:VirtualPin edc:name="RK1"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="AN38"/>
      <edc:VirtualPin edc:name="EBIA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 271-->
      <edc:VirtualPin edc:name="DDRA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 272-->
      <edc:VirtualPin edc:name="DDRA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 273-->
      <edc:VirtualPin edc:name="DDRA12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 274-->
      <edc:VirtualPin edc:name="DDRA14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 275-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 276-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBIA15"/>
      <edc:VirtualPin edc:name="GD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 277-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="SCL5"/>
      <edc:VirtualPin edc:name="RPF5" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBID8"/>
      <edc:VirtualPin edc:name="GD16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 278-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RPG1" edc:ppsgroup="1" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBIA9"/>
      <edc:VirtualPin edc:name="GD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 279-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="RPE3" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="EBID3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 280-->
      <edc:VirtualPin edc:name="RH6"/>
      <edc:VirtualPin edc:name="ERXD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 281-->
      <edc:VirtualPin edc:name="RH10"/>
      <edc:VirtualPin edc:name="ECOL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 282-->
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="ETXD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 283-->
      <edc:VirtualPin edc:name="RJ9"/>
      <edc:VirtualPin edc:name="ETXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 284-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 285-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="RPD7" edc:ppsgroup="2" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 286-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 287-->
      <edc:VirtualPin edc:name="RK7"/>
      <edc:VirtualPin edc:name="EBIA21"/>
      <edc:VirtualPin edc:name="GD19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 288-->
      <edc:VirtualPin edc:name="RK6"/>
      <edc:VirtualPin edc:name="EBIA20"/>
      <edc:VirtualPin edc:name="GD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 289-->
      <edc:VirtualPin edc:name="DDRA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 290-->
      <edc:VirtualPin edc:name="DDRA8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 291-->
      <edc:VirtualPin edc:name="DDRA13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 292-->
      <edc:VirtualPin edc:name="DDRBA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 293-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="RPD12" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="EBIA12"/>
      <edc:VirtualPin edc:name="GD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 294-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="RPD9" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBID15"/>
      <edc:VirtualPin edc:name="GD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 295-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBIA10"/>
      <edc:VirtualPin edc:name="GD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 296-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RPF3" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="ERXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 297-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="SDA5"/>
      <edc:VirtualPin edc:name="RPF4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBID9"/>
      <edc:VirtualPin edc:name="GD17"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 298-->
      <edc:VirtualPin edc:name="RH5"/>
      <edc:VirtualPin edc:name="ERXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 299-->
      <edc:VirtualPin edc:name="RH12"/>
      <edc:VirtualPin edc:name="ECRS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 300-->
      <edc:VirtualPin edc:name="RH8"/>
      <edc:VirtualPin edc:name="ERXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 301-->
      <edc:VirtualPin edc:name="RJ11"/>
      <edc:VirtualPin edc:name="EREFCLK"/>
      <edc:VirtualPin edc:name="ERXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 302-->
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 303-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 304-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 305-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="EBIRDY1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 306-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 307-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 308-->
      <edc:VirtualPin edc:name="DDRA11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 309-->
      <edc:VirtualPin edc:name="DDRA15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 310-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 311-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 312-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="SCK4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 313-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBIA11"/>
      <edc:VirtualPin edc:name="GD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 314-->
      <edc:VirtualPin edc:name="RH15"/>
      <edc:VirtualPin edc:name="EBIA23"/>
      <edc:VirtualPin edc:name="GD21"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 315-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RPG0" edc:ppsgroup="2" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBIA8"/>
      <edc:VirtualPin edc:name="GD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 316-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="EBID2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 317-->
      <edc:VirtualPin edc:name="RH13"/>
      <edc:VirtualPin edc:name="ERXDV"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 318-->
      <edc:VirtualPin edc:name="RH9"/>
      <edc:VirtualPin edc:name="ERXD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 319-->
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="ETXD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 320-->
      <edc:VirtualPin edc:name="RJ8"/>
      <edc:VirtualPin edc:name="ETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 321-->
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="ETXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 322-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="RPD6" edc:ppsgroup="1" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXEN"/>
    </edc:Pin>
